/***********************************************************************************************************************************
 * 
 * 功能：设计模式——复合模式
 * 
 * 作者：chaoxiong
 * 
 * 时间：2014-9-30(It's a happy day,isn't is?)
 *       2014-10-6(The holiday is ending...)
 * 
 * 参考：
 * 
 * 备注：
 * 复合模式，只是携手合作的许多模式；但复合模式必须够一般性，适合解决许多问题才行；复合模式MVC(Model-View-Controller)；
 * 复合模式在一个解决方案中结合两个或多个模式，以解决一般或重复发生的问题；
 * 
 ***********************************************************************************************************************************/

namespace CompoundDemo
{
    using System;
    using System.Collections.Generic;
    using System.Text;

    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
