/***********************************************************************************************************************************
 * 
 * 功能：设计模式——观察者模式(出版者、订阅者)
 * 
 * 作者：
 * 
 * 时间：
 * 
 * 参考：
 * 
 * 备注：监听对象
 * 
 ***********************************************************************************************************************************/

namespace ObserverDemo.Interface
{
    using System;

    /// <summary>
    /// 订阅者（观察者，Observer）
    /// </summary>
    public interface IObserver
    {
        void Update(DateTime date, string weather, string mode);
    }
}
