/***********************************************************************************************************************************
 * 
 * 功能：设计模式——模板方法模式
 * 
 * 作者：chaoxiong
 * 
 * 时间：2014-9-24
 * 
 * 参考：
 * 
 * 备注：
 * 泡咖啡(Coffee)、沏茶(Tea)有重复代码，需要清理设计-->抽取出共同代码，得到咖啡因饮料()；
 * 
 ***********************************************************************************************************************************/

namespace TemplateMethodDemo
{
    using System;
    using System.Collections.Generic;
    using System.Text;

    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
