/***********************************************************************************************************************************
 * 
 * 功能：设计模式——状态模式
 * 
 * 作者：chaoxiong
 * 
 * 时间：2014-9-27
 * 
 * 参考：
 * 
 * 备注：
 * 第十章、状态模式，模拟糖果机的工作；
 * 
 * 
 ***********************************************************************************************************************************/

namespace StatePattern
{
    using System;
    using System.Collections.Generic;
    using System.Text;

    class Program
    {
        static void Main(string[] args)
        {
            Console.ReadKey(true);
        }
    }
}
