/***********************************************************************************************************************************
 * 
 * 功能：设计模式——解释器模式
 * 
 * 作者：chaoxiong
 * 
 * 时间：2014-12-15
 * 
 * 参考：
 * 
 * 备注：
 * 
 ***********************************************************************************************************************************/

namespace InterpreterDemo
{
    using System;
    using System.Collections.Generic;
    using System.Text;

    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
